[
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "LOUISVILLE, Ky. — Two-year-old Courtney was squirming in her father’s arms and fussing as he tried to keep hold of her on a warm summer evening near Louisville’s Big Four Pedestrian Bridge."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Jonathan White laughs as he helps his soon-to-be-adopted daughter Courtney, 2, up a ladder at the park on June 9."},
{"desc": "(Photo: Lauren Nolan, The (Louisville) Courier-Journal)"},
{"desc": "LOUISVILLE, Ky. — Two-year-old Courtney was squirming "},
{"desc": "in her father’s arms"},
{"desc": " and fussing as he tried to keep hold of her on a warm summer evening near Louisville’s Big Four Pedestrian Bridge."},
{"desc": "“Oh, no, she’s not happy,” said Jonathan White about his daughter."},
{"desc": "The struggle was only brief after White, Courtney and his nine-year-old son Deonquaye arrived at the playground near the bridge. Soon, Courtney’s grouchy mood passed as she spotted the throng of children climbing on stairs, slipping down slides and running through spraying water. When White put her down, she took off running toward the crowd with Deonquaye and their father trailing her."},
{"desc": "Since school ended for Deonquaye, White, 48, has been taking his children to the park about twice a week, usually after a dinner out somewhere - often at places that have discounted or free children’s meals. During the day, Courtney goes to child care for part of the day and Deonquaye is going to a day camp. White’s summer weeks are filled with plenty of driving, planning and grocery shopping among the fun walks, swimming, movies and more family-friendly activities."},
{"desc": "This kind of summer routine reflects the sometimes chaotic to-do list for a single parent - but White isn't just any single parent."},
{"desc": "White, a Jefferson County Public Schools mental health and substance abuse counselor, is part of a growing group of single men throughout the nation who are adopting children, many of whom call themselves"},
{"desc": " \""},
{"desc": "single fathers by choice.”"},
{"desc": "“The poopy diaper and all of that was such a wonderful experience for me,” said White, about when he first took Courtney home in the fall of 2013. “I had always wanted children.”"},
{"desc": "Jonathan White reminds Courtney, 2, that she needs to eat her sandwich while eating dinner at McAlister's Deli on June 9."},
{"desc": " "},
{"desc": "(Photo: Lauren Nolan,)"},
{"desc": "Single men adopting children is a nationally growing trend."},
{"desc": "“It’s happening everywhere as there are more men who want to be dads even when they are not married or attached in another way,” said Adam Pertman, president of the Boston-based "},
{"desc": "National Center on Adoption and Permanency"},
{"desc": " and author of “Adoption Nation: How the Adoption Revolution is Transforming Our Families—and America.”"},
{"desc": "Dean Otto, who came to Louisville to be the Speed Art Museum’s film curator, adopted his daughter Destiny at two-years-old in Minneapolis, where he was then living and working.  After making the move to Louisville last fall, Destiny, now 14, is enrolled at the "},
{"desc": "St. Francis School"},
{"desc": " in Goshen. She will attend St. Francis High School for her freshman year."},
{"desc": "His decision to adopt came after seeing his two married brothers have children."},
{"desc": "“I saw how being parents helped make them better people,” he said. “But I also enjoyed spending time with my nieces and nephews and wanted to have that same experience.”"},
{"desc": "USA TODAY"},
{"desc": "Involved fathers matter -- but do they get enough credit?"},
{"desc": "Otto said he had thought about adopting while he worked in the museum world - working on film programs and writing grants. But his decision to adopt through the foster care system came after he took a year off and applied his fundraising skills to a job at the "},
{"desc": "National Committee to Prevent Child Abuse"},
{"desc": " in Chicago."},
{"desc": "“I saw what was lacking in children’s lives and (I) was coincidentally living across from a take-in center for child abuse cases,” he said."},
{"desc": "While adopting through the foster care system isn’t the only way of becoming a father – it is the most popular, said Pertman."},
{"desc": "Brian Tessier echoed Pertman’s viewpoint. An attorney in family law in Boston, Tessier adopted two boys as a single man and now his oldest son is 14. After his experiences, he started a hotline for prospective single fathers nearly five years ago that now has a Facebook page called “"},
{"desc": "The 411 4 DAD"},
{"desc": ".”"},
{"desc": "“Foreign adoption is expensive and fraught with its own problems and surrogacy is also expensive and difficult,” Tessier said. “Then when you look at foster care, you have 500,000 kids today in the system and Kentucky is a pretty tough state.”"},
{"desc": "As of this month, the "},
{"desc": "Kentucky Cabinet for Health and Family Services"},
{"desc": " reported that more than 8,000 children are in out-of-home care throughout the state, the highest number on record. That shows a need for foster parents and adoptive parents when birth parents and extended family lose rights to be permanent caretakers for children in the system, according to both Tessier and Pertman."},
{"desc": "Tessier sees more men seeking to be those permanent caretakers. He thinks society should do more to encourage men to adopt – and particularly adopt boys who have had rough starts in life."},
{"desc": "“You have a male population who want to become fathers and think they can’t. Then you have so many boys who need male role models. But we don’t make that connection,” he said."},
{"desc": "Meanwhile, there are a growing number of single fathers, including those who are widowed, divorced, separated and never married. National "},
{"desc": "Census"},
{"desc": " figures from 2014 show 2.75 million children live with a single father and nearly 30 percent of those are men who have never been married. That compares with 1.8 million in 2000 and 1.2 million in 1990. Census numbers do not specify if any of these parents are “fathers by choice.”"},
{"desc": "As Otto, 49, settles more into his job at the museum, Destiny has spent the beginning of her summer going to Lakeside Swim Club with her friends. She often peruses the internet for dinner recipes they can cook together and to find houses for sale — the family is living in an apartment since their move to town but are looking for something more permanent. She spends some time keeping in touch with friends from Minneapolis via Facetime and is planning to join the choir at St. Stephen Church with one of her new friends."},
{"desc": "Because Otto is white and Destiny is African-American, she sometimes gets questions from her peers."},
{"desc": "“Younger kids say, ‘Your dad’s white?’ But I just tell them he adopted me and they say, ‘Oh, that’s cool,'” Destiny said."},
{"desc": "Each day, Destiny works through a list of activities Otto leaves for her in the morning that urge her to read, clean around the apartment, watch French programs and “think nice thoughts.”"},
{"desc": "“I don’t think she quite realizes how independent she can be here yet,” Otto said."},
{"desc": "Both White and Otto began thinking about more about becoming fathers when they were in their 20s."},
{"desc": "White, who came to Louisville from Tennessee as a toddler to live with his grandmother after his father’s death, said he realized that he could become a father through the foster care system after his mother, who had moved to Louisville, was fostering children. He also worked in the child welfare system, giving him a better understanding of the need for foster parents."},
{"desc": "Deonquaye, 9, and Courtney, 2, take a break from running at the park on June 9."},
{"desc": " "},
{"desc": "(Photo: Lauren Nolan)"},
{"desc": "While more men are adopting, these want-to-be dads still face a system shaped by a world where women have been considered the main caretakers for children."},
{"desc": "“There is still a hierarchy in child placement that tends to prefer a married couple and women as caretakers. That’s just the reality on the ground,” Pertman said."},
{"desc": "USA TODAY"},
{"desc": "Sheryl Sandberg: Hard to lean in as single mom"},
{"desc": "White said he sees that hierarchy, but was able to overcome it given his career working in social services and understanding of how the foster care system functions. That experience helped him not only adopt Courtney and Deonquaye, but helped make sure each child didn’t fall through the cracks during foster care prior to adoption – particularly when social workers on either child’s case changed between times they spent with members of their birth families."},
{"desc": "But most men don’t have White’s background. Tessier said he often hears from those men via his organization."},
{"desc": "“I have men call me and they’re emotional messes because they just want to be fathers,” he said."},
{"desc": "Pertman said much of the significant effort to adopt via foster care comes through the system’s careful vetting process, which includes classes prospective parents are often required to taken over the course of a year, a thorough background check and an examination of the adult’s home to ensure it is suitable for children."},
{"desc": "Pertman and Tessier are seeing a cultural shift where it’s more acceptable for men to be single parents – much of that influenced by the corporate world as more companies establish policies designed to help male employees make time for fatherhood."},
{"desc": "“Mark Zuckerburg help put a different connotation on fatherhood in the workplace,” Tessier said of the Facebook mogul who is vocal about his hands-on parenting on social media."},
{"desc": "But both White and Otto said raising children as a single parent includes a lot of help from friends and family."},
{"desc": "For White, that comes when a close friend offered to take care of Courtney and the support he gets from his faith community at St. Stephen Church."},
{"desc": "From the time he adopted Destiny in Minneapolis, Otto found support from several close friends, including a couple who often live with him and Destiny to form what he called \"a more alternative family with my best friends.\""},
{"desc": "That has given Destiny her own outlook on not only her own family but others'."},
{"desc": "\"I think all families are different in their own ways, but sometimes you just can’t see it,\" Destiny said. \"But I think my family is pretty cool.\""},
{"desc": "Follow Elizabeth Kramer on Twitter: "},
{"desc": "@arts_bureau"},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "LEHIGH ACRES, Fla. — An argument the day before Father's Day turned deadly for a newlywed and expectant father who was shot and killed by his neighbor along with the neighbor's wife when he tried to help the couple mediate an argument."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "A scene from a shooting that left two dead in Lehigh Acres, Fla., Saturday night."},
{"desc": "(Photo: Kinfay Moroti, The (Fort Myers, Fla.) News-Press)"},
{"desc": "LEHIGH ACRES, Fla. — An argument the day before Father's Day turned deadly for a newlywed and expectant father who was "},
{"desc": "shot and killed by his neighbor along with the neighbor's wife"},
{"desc": " when he tried to help the couple mediate an argument."},
{"desc": "The Lee County Sheriff's Office arrested Placido Moreno-Torres, 47, for the double homicide after he was identified as the person responsible."},
{"desc": "A report from the sheriff's office said witnesses told investigators they heard Moreno-Torres and his wife Amparo Moreno, 44, arguing outside their home and then heard gun shots."},
{"desc": "The sheriff's report said Ricardo Vaca, 20, a neighbor of the Morenos who was married May 29 and described by relatives as a \"great son,\" heard the arguing and went to the Moreno’s driveway to intercede and mediate between the couple."},
{"desc": "The sheriff's report said his concern appears to be his only involvement in the matter."},
{"desc": "The sheriff's office said Moreno-Torres shot and killed both his wife and Vaca and then fled on foot. Both victims died at the scene."},
{"desc": "Witnesses quickly identified Moreno-Torres as the shooter."},
{"desc": "Moreno-Torres was eventually found and arrested. He was booked into Lee County Jail for two counts of homicide and one count of aggravated assault with a deadly weapon and is scheduled for arraignment on July 18."},
{"desc": "A Facebook page for Vaca said he graduated from Lehigh High School in 2015 and just got married on May 29. There was also a photo of a sonogram on the page."},
{"desc": "Nestor Martinez Vaca said his cousin and his new wife Alma had a baby on the way."},
{"desc": "\"She's going to be a girl, they were happily married and he was an amazing person, always happy and trying to make people smile, funny, a good student and an amazing son,\" Vaca's cousin said. \"We as a family are devastated.\""},
{"desc": "Nestor Martinez Vaca said his relative was \"the greatest person and my dearest cousin.\""},
{"desc": "The incident originated at the Moreno-Torres home, according to the Lee County Sheriff's Office."},
{"desc": "According to deputies, they responded to a \"shots fired\" call at that address and arrived to find two victims who had died from their wounds."},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "Seven hard days after nightclub became the site of the worst mass shooting in U.S."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "A couple embraces outside Parliament House, an LGBT nightclub, close to the one-week anniversary of the Pulse nightclub mass shooting late Saturday, June 18, 2016, in Orlando."},
{"desc": "(Photo: David Goldman, AP)"},
{"desc": "Seven hard days after it became the site of the worst mass shooting in U.S. history, Orlando remembered the fallen Sunday with pealing church bells and — from normally raucous nightclubs to Disney World — moments of silence."},
{"desc": "An estimated 20,000 people prepared for an early evening vigil at Lake Eola Park for the victims of the Pulse nightclub shooting, preceded by a memorial service at the Cathedral Church of St. Luke. Mourners planned to march from the church to the lakeside park, carrying flowers, candles and messages of peace."},
{"desc": "Several churches held memorial services during the day. Florida Gov. Rick Scott, speaking at First Baptist Church, one of the area’s largest churches, said the attacks targeted “two very vulnerable populations” — meaning gays and Latinos."},
{"desc": "People prayed on the street and left balloons, flowers, pictures and posters to honor all 49 victims. Some visited a row of 49 white wood crosses made by a retired carpenter from Illinois; others waited in line at Realm Tattoos for a “One Pulse” tattoo."},
{"desc": "The tattoos were free, but people were encouraged to leave a donation for the victims."},
{"desc": "Antaeus Schembri was there Saturday. He said he got a tattoo on his forearm to \"show support to the city that I love.\""},
{"desc": "Meanwhile, the investigation continued into why Omar Mateen, 29, invaded the gay nightclub and opened fire around 2 a.m. on June 12, killing 49 and wounding 53 before being killed by police who stormed the building. He also pledged allegiance to the Islamic State militant group in a 911 call during the attack."},
{"desc": "Eighteen of the wounded victims remained hospitalized Sunday. Four were in critical condition, two were listed as guarded and 12 as stable."},
{"desc": "Crosses, one for each victim, line a walkway as a memorial to those killed a week ago in the Pulse nightclub mass shooting a few blocks from the club early Sunday, June 19, 2016, in Orlando."},
{"desc": " "},
{"desc": "(Photo: David Goldman, AP)"},
{"desc": "U.S. Attorney General Loretta Lynch said Sunday that the FBI would release a partial transcript of three conversations between Mateen and Orlando police negotiators that took place while the gunman was inside the club."},
{"desc": "Appearing on ABC’s "},
{"desc": "This Week"},
{"desc": ", Lynch said authorities hope to create a profile of Mateen to help prevent a similar disaster: “We are going back and learning everything we can about this killer, about his contacts, people who may have known him or seen him.’’ On Tuesday she’ll go to Orlando to meet investigators."},
{"desc": "Lynch said a key goal of the investigation was to determine why Mateen apparently targeted the LGBTQ community. She declined to say if a federal grand jury was likely to charge Mateen's second wife, Noor Salman, who officials say knew her husband planned the attack."},
{"desc": "Investigators are trying to learn more not just about Mateen, but also about others who knew him, including members of the mosque he attended."},
{"desc": "Omar Saleh, a lawyer for the Council of American-Islamic Relations, said he sat in on a half-hour interview Friday with a man who has worshiped at the Islamic Center of Fort Pierce, which Mateen also attended."},
{"desc": "Sunday's observances of a week's passage since the attack began when the day was young. The music stopped around 2 a.m. at many of the area's nightclubs to mark the moment when the killing began."},
{"desc": "Worshipers embrace during a service at Joy Metropolitan Community Church, one week since the Pulse nightclub mass shooting Sunday, June 19, 2016, in Orlando."},
{"desc": " "},
{"desc": "(Photo: David Goldman, AP)"},
{"desc": "Around midnight, after Disney World's usual “Kiss Goodnight’’ announcement, park workers and visitors gathered to pay tribute to the victims. They held glow sticks, smartphones and artificial candles in the air during a moment of silence."},
{"desc": "Participants in the observance, which was not organized by the theme park, arranged the glow sticks into a rainbow heart that rested at the base of Disney’s Cinderella Castle."},
{"desc": "They also gathered for photos in front of an 11-by-7-foot rainbow flag with a black heart that showed a pulse beat in its center, and they made heart symbols with their hands."},
{"desc": "One of the Pulse victims, Jerald Wright, worked in a store at the park."},
{"desc": "Orlando’s professional soccer team honored the victims Saturday night by blocking off 49 stadium seats with rainbow-colored balloons."},
{"desc": "Players at the MLS game between Orlando City and the San Jose Earthquakes wore rainbow-colored socks and sweatbands; fans waved rainbow flags (in addition to the usual ones of players’ home countries). Play was stopped at the 49th minute for a moment of silence, and fans wearing colored shirts created a rainbow in the stands."},
{"desc": "The game ended in a tie."},
{"desc": "Contributing: Chris Bonanno, Florida Today"},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "NEWARK, Del. — The Delaware SPCA, the state’s oldest animal welfare organization that once handled dog control for all three counties, shuttered its Stanton facility Friday and is negotiating to sell the sprawling, nearly 21-acre property."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "\n    Hundreds of animals are buried in a pet cemetery behind the Stanton Delaware SPCA. Pet owners were notified through Facebook that they could claim the bodies and head stones of their beloved animals before the land is sold.\n    "},
{"desc": "A couple, that did not want to be identified, have been digging up four dogs that they had buried over the years in the Delaware SPCA Stanton pet cemetery. So far, they have only been able to find three of the dogs."},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "(Photo: Jennifer Corbett, The (Wilmington, Del.) News Journal)"},
{"desc": "NEWARK, Del. — The Delaware SPCA, the state’s oldest animal welfare organization that once handled dog control for all three counties, shuttered its Stanton facility Friday and is "},
{"desc": "negotiating to sell the sprawling, nearly 21-acre property"},
{"desc": "."},
{"desc": "But what’s buried three feet under threatens to derail the deal."},
{"desc": "Behind the newly renovated shelter building is a weedy, overgrown lot that contains the bagged remains of more than 1,000 animals — in what was meant to be their final resting place. The inhabitants include \"Captain,\" the country's first police dog; Igloo, the Brandywine Zoo bear; Minnie Pearl, a goat; and mother-daughter poodles Brigitte and Babette."},
{"desc": "But with potential commercial development banging on the door of the cash-strapped nonprofit organization, irate pet owners have been told that they have until the end of the month to remove their pets' headstones, along with exhuming and relocating what's left of the animals' bodies, if they so choose."},
{"desc": "\"That is going to be a heartbreaking nightmare,\" said Kurt Gingher, who spent a recent steamy weekend using a scraper to clear off several hundred stones until he found the two marked with his pets' names. An Internet company owner who lives in Thailand, Gingher happened to be in town visiting his family in Elsmere when he heard about the shelter closure."},
{"desc": "Confusion persists after the shelter closed Friday. On Saturday afternoon, Linda Cohan said she attempted to collect the remains and headstones of her childhood poodle, Coquette, and her grandmother’s Boston bulldog, Mitzi, both of whom were buried in the 1970s."},
{"desc": "She said a woman on the SPCA's grounds turned her away and threatened to call the police."},
{"desc": "“I don’t know what the plan is. Nobody knows anything,” said Cohan of Boothwyn, Pennsylvania. The woman couldn’t provide her with any information, she said, and told her to contact the Delaware SPCA’s board or its Georgetown location."},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "Gay bars remembered the shooting spree in Orlando in many ways. "},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "A sign with the logo of the Pulse nightclub hangs on the entrance as revelers for \"New Orleans Pride\" festivities enter Mags 940 Bar in New Orleans, Saturday, June 18, 2016."},
{"desc": "Former SPCA Director John Caldwell kneels beside a head stone in the pet cemetery in a 2007 photo."},
{"desc": " "},
{"desc": "(Photo: Matthew Jonas, The (Wilmington, Del.) News Journal)"},
{"desc": "A representative from Georgetown spoke to Cohan by phone Saturday but said he had no information, Cohan said. Delaware SPCA leaders did not return phone calls from "},
{"desc": "The News Journal"},
{"desc": " Saturday. Reached by phone, Interim Board President Diane Ferry, an associate management professor at the University of Delaware, declined comment. She referred questions to a Delaware SPCA spokesperson, whom she identified as Andrea Perlak. Perlak resigned as the organization's executive director at the end of last month and did not respond to a phone call and email Saturday."},
{"desc": "And there's another curious twist: Somewhere on the property are the ashes of a human, a female pet owner who asked to be buried alongside her dog, according to a former director of the Delaware SPCA and board meeting minutes."},
{"desc": "Through its attorney Geoffrey R. Johnson of Jenkintown, Pennslyvania, the Delaware SPCA recently told "},
{"desc": "The News Journal"},
{"desc": " that line of questioning was \"absurd.\""},
{"desc": "The Delaware SPCA “has no knowledge of any human remains on our Stanton property,\" the organization wrote."},
{"desc": "But former longtime Delaware SPCA director John Caldwell remembers. Caldwell, who joined the organization as an animal control officer in 1974 and remained there for 33 years, said he personally saw the headstone, though he could not recall the name of the individual, and confirmed the burial with Delaware SPCA’s former cemetery caretaker."},
{"desc": "The News Journal"},
{"desc": " obtained Delaware SPCA board meeting minutes from December 1980 showing that the board approved interring \"Miss Ligon's ashes\" in the cemetery. No further details were listed."},
{"desc": "The Delaware SPCA's plans to sell its Stanton shelter building and property."},
{"desc": "(Photo: Gerald Herbert, AP)"},
{"desc": "Gay bars and nightclubs across the USA increased security over the weekend, one week after the horrific shootings at the Pulse nightclub in Orlando, but attendance remained high in solidarity."},
{"desc": "“It showed that we’re not going to live in fear,\" said Randy Long, owner of Boyztown, a Denver gay bar. \"We’ve had to keep fighting for a lot in the gay community.”"},
{"desc": "He said the bar worked closely with police, who stayed nearby throughout Denver's LGBT pride weekend, which helped attract additional customers."},
{"desc": "USA TODAY"},
{"desc": "Orlando marks week after Pulse massacre: tears and questions"},
{"desc": "“It was packed, you couldn’t hardly even move on the patio,” Long said. Boyztown collected more than $1,500 in donations over the weekend for the Orlando victims and families."},
{"desc": "In New York City, the Monster in Greenwich Village used metal detector wands and searched patrons’ bags. The gay bar is across the street from the historic Stonewall Inn, site of riots in 1969 that sparked the gay rights movement in the USA."},
{"desc": "“We’re just trying to stay positive and not let the fear take over,” said Rodrigo Dasilva, manager of the Monster."},
{"desc": "The 700 Club in New Orleans changed its name to Pulse for the weekend, as did other gay bars in the city."},
{"desc": " "},
{"desc": "(Photo: Jennifer Corbett,)"},
{"desc": "A pet cemetery contract from 1973, also obtained by "},
{"desc": "The News Journal"},
{"desc": ", shows that nationally recognized sculptor, Maurine Ligon, buried her collie, Lady, behind the Delaware SPCA in 1973. Ligon, who lived and worked in the half-octagonal old town library in New Castle, died in 1980 due to complications from a car accident, according to New Castle Historical Society records."},
{"desc": "The day before the accident, Ligon visited Lady's grave at the Delaware SPCA and complained about grass covering the tiny plot. The impassioned dog lover had no living relatives, the historical society said."},
{"desc": "Pet cemeteries are not regulated by federal or state governments because animal remains are considered \"solid waste\" under Delaware law. But human cemeteries fall under the state's authority."},
{"desc": "If a human is buried on the property, the SPCA would need to register that specific plot as a cemetery, committing to its care in perpetuity. Otherwise, the organization would need to apply for a permit to relocate the remains, said Emily Knearl, a spokeswoman for the state Division of Public Health. The health department is still waiting for the SPCA to confirm that a human is, indeed, buried on-site. On Friday, after "},
{"desc": "The News Journal"},
{"desc": " published an earlier version of this story online, the health department wrote a formal letter to the Delaware SPCA reminding the organization of its obligations, Knearl said."},
{"desc": "In the meantime, Delaware SPCA’s land, located next to the Border Café in Stanton, is being marketed for $9.8 million. Proceeds from the sale are expected to benefit Delaware SPCA’s smaller Georgetown shelter, the only animal shelter in Sussex County."},
{"desc": "Besides the Delaware SPCA, with its properties in Stanton and Georgetown, there are two other SPCA organizations working in the First State –– and none are affiliated."},
{"desc": "By consolidating services and moving the remaining adoptable animals to Sussex County, according to a post the Delaware SPCA made on its Facebook page last month, the organization expects to “create the most financially stable animal welfare organization the state.”"},
{"desc": "Employee Lawrence Shepherd said the 700 Club did not take extra security measures, but the city's weekend pride festivities brought many new customers to the neighborhood gay bar where workers generally know the patrons."},
{"desc": "\"I was paying a lot more attention to everyone that walked in the door,\" he said. \"It was a lot strangers and a lot of people we didn’t know.\""},
{"desc": "Visitors brave the rain to view the 49 crosses at  the makeshift memorial outside Orlando Regional Medical Center on June 19, 2016."},
{"desc": " "},
{"desc": "(Photo: Joe Burbank, AP)"},
{"desc": "Brad Bayof, general manager of Sidetrack in Chicago, said gay bars have always been more aware of security concerns compared with other bars. Sidekick urged customers to leave their bags and backpacks at home over the weekend to lessen the time to get through security lines, Bayof said."},
{"desc": "The Orlando shootings a week ago Sunday left 49 dead and 53 injured. The suspect was shot and killed by police. Many gay pride events this weekend around the country paid homage to the Orlando massacre."},
{"desc": "Bayof said bar-goers remembered the Orlando tragedy in various ways over the weekend: donating money, writing words of support on murals around the bar or hugging their favorite bartender."},
{"desc": "Gay bars have always served as safe spaces for the LGBT community, Bayof said, so staying open during trying times remains important."},
{"desc": "“For decades, gay bars were the community centers for the gay community,” he said. “They were the only place where people could go to find people like them.”"},
{"desc": "Until then, the dismantling of the half-century-old cemetery, one of the largest pet cemeteries in the state, is the most visible reminder of an organization that has struggled for years amid dwindling grant dollars, lost contracts and escalating expenses."},
{"desc": "Current SPCA leaders maintain that the nonprofit had to cut programs and staff in the last two years to address persistent operating deficits at the organization for nearly a decade, exacerbated by an out-of-state animal control provider securing a statewide contract to handle dog control. The Brandywine Valley SPCA, with headquarters in West Chester, Pennsylvania, established its satellite shelter in Old New Castle."},
{"desc": "Former Delaware SPCA employees –– who requested anonymity because they feared retaliation –– criticized senior SPCA leadership for pursuing costly for-profit ventures on the property that never materialized, such as a commercial retail strip, an estimated $1.4 million doggie daycare and boarding services, at the expense of the SPCA's core mission of preventing animal cruelty."},
{"desc": "Michael Gallagher, who resigned from the board last year after eight years, also said there were issues."},
{"desc": "“The spending got out of control,” said Gallagher."},
{"desc": "In the weeks following the shelter closing announcement, a majority of current board members and Perlak have either declined comment or did not respond to phone calls from "},
{"desc": "The News Journal"},
{"desc": "."},
{"desc": "Earlier this month, the Delaware SPCA's attorney provided email responses to some of the questions posed by the newspaper."},
{"desc": "“Decreasing competition in New Castle County by closing the Stanton shelter and thereby decreasing the number of competing shelters from four down to three shelters will benefit all the remaining animal shelters in the country,” the organization wrote."},
{"desc": "Disappointed community members are circulating an online "},
{"desc": "petition"},
{"desc": ", with more than 1,500 signatures as of Saturday evening, urging the board to reverse its decision and save the building on secluded land, which was donated to Delaware SPCA by the late philanthropist Emily du Pont."},
{"desc": "Du Pont's granddaughter Emily Bramhall, who lives in Massachusetts, signed the petition after learning of the land sale. She said her grandmother, a staunch conservationist and animal advocate who cared for three to four dogs at any one time, would never have condoned such a sale. The family is weighing next steps, said Bramhall, who hopes that Delaware Attorney General Matt Denn will intervene."},
{"desc": "\"I can assure you this was never her intent,\" Bramhall said. \"What they are doing is breaking the trust. And what does that say to future donors?\""},
{"desc": "As Shepherd in New Orleans said, \"Our community has been targeted enough. ... It’s interesting to see people coming together in a way they wouldn’t normally.\""},
{"desc": "Neighbors will not only lose a state-of-the-art shelter but also Delaware SPCA's low-cost vaccination clinics, spay and neuter services and a pet food pantry for low-income owners. The 30-some feral cats who live in igloos on the property are expected to be trapped and moved to Georgetown, according to a volunteer caretaker."},
{"desc": "Patti Flinn, of New Castle, is vowing to fight. In 1991, Flinn paid $300 to bury her Cocker Spaniel, Jody, at the SPCA’s pet cemetery.  A copy of her signed contract shows the term limit crossed out with a series of typewritten Xs. In its place is \"perpetual care\" written in blue ink."},
{"desc": "\"Unbelievable,\" Flinn said of Delaware SPCA's intentions to shutter the facility and leave for Sussex County. The reason \"you go to a pet cemetery is you always have a place to go back to.\""},
{"desc": "Patti Flinn holds her current dog, 7-year-old Schnauzer Munchkin, with old photographs of her 11-year-old cocker spaniel, Jody, who was buried in the Stanton SPCA cemetery."},
{"desc": " "},
{"desc": "(Photo: JENNIFER CORBETT)"},
{"desc": "Multiple cemetery contracts reviewed by "},
{"desc": "The News Journal"},
{"desc": ", including one completed as recently as 1998, specify that “the Delaware SPCA guarantees continued use and upkeep of the grave site for the period of twenty-five (25) years.\" The Delaware SPCA stopped burying animals more than a decade ago, after offering the service for the last half-century, according to cemetery records."},
{"desc": "If the Delaware SPCA fails to abide by its contract terms, it could risk being sued for breach of contract, according to two national cemetery experts interviewed by "},
{"desc": "The News Journal"},
{"desc": "."},
{"desc": "\"If they have a contract with the people, they're bound by it,\" said Poul Lemasters, a funeral industry attorney who consults on pet burials."},
{"desc": "In an email last week to "},
{"desc": "The News Journal"},
{"desc": ", the Delaware SPCA wrote that customers can \"collect a refund on their contract if they so desire. Any gravestones not collected at the time of sale of the property will be collected and a memorial will be created in Georgetown.\""},
{"desc": "Michael Smith, the lone board member who agreed to speak with The News Journal, said he missed the previous two board meetings and could not comment on the board's plans for the pet cemetery. He said he would advocate for leaving the area undisturbed."},
{"desc": "Four pet owners interviewed by "},
{"desc": "The News Journal "},
{"desc": "said they visited the shelter in the last two weeks only to be told by Delaware SPCA staffers that they could not provide a map of the cemetery showing where individual pets had been buried, nor could they help with removing remains. Volunteers have worked to expose the headstones, marking them with orange flags. Last week, an older couple, who declined to be identified, began the task of unearthing their pets’ bones."},
{"desc": "USA TODAY"},
{"desc": "N.Y. close to allowing pets to be buried with their owners"},
{"desc": "As of earlier this month, Delaware's Office of Animal Welfare had received no complaints about the SPCA cemetery. But the office has no jurisdiction over pet cemeteries, which are self-regulated."},
{"desc": "The fate of the cemetery isn't the only obstacle to what could be a lucrative land deal for the Delaware SPCA. A Newark developer is suing the animal welfare organization, trying to block the property sale."},
{"desc": "Under a 2012 agreement, the SPCA hired Bariglio Corporation to help recruit commercial tenants for the front portion of its property, providing a sustainable source of income. But last year, the SPCA initiated sales discussions with other parties without Bariglio's consent and in violation of its contract, according to a lawsuit filed earlier this year in Chancery Court."},
{"desc": "The Delaware SPCA has moved to dismiss all of Bariglio's claims, arguing that Bariglio \"does not allege any damages flowing from the alleged breaches that would warrant injunctive relief.\""},
{"desc": "While the case is ongoing, at least one offer for the land is on the table."},
{"desc": "Fusco Management, which owns two neighboring properties, submitted an offer to buy roughly half of Delaware SPCA's property about two weeks ago and is awaiting a response, according to Vice President Frankie Vassallo. He said he first offered to buy the land from the SPCA about five years ago but was turned down."},
{"desc": "Vassallo said he's only interested in the back portion of the SPCA property that contains the shelter building to expand his company's ownership stake in the area, rather than develop it immediately. He was not aware of the cemetery dispute."},
{"desc": "\"Obviously, we would want all of that resolved,\" he said. \"I'm not taking on any of the sellers' obligations.\""},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "A group of Texas police officers are trading in their uniforms for capes, and they’re doing it for a very special group of kids."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "\n    A group of police officers in Austin, Texas are trading in their uniforms for capes for a special group of kids.\n    "},
{"desc": "KVUE"},
{"desc": "These Texas police officers are trading in their uniforms for capes for a special group of kids."},
{"desc": "(Photo: KVUE)"},
{"desc": "A group of Texas police officers are trading in their uniforms for capes, and they’re doing it for "},
{"desc": "a very special group of kids"},
{"desc": "."},
{"desc": "\"Just even for a moment, if we can get them to take their minds off what's going on, it's well worth it,” said Officer Matt Harmatuk with the Austin Police Department, mastermind behind the second-annual Super Hero Day at Dell Children's Medical Center."},
{"desc": "Harmatuk recruited members of the Austin Police Department and SWAT Team to don their costumes and get into character for the kids."},
{"desc": "They'll begin the event by dropping into the Dell Children's courtyard by helicopter and by rappelling down the sides of the building."},
{"desc": "The patients and their families will line the hallways on three floors of the hospital, looking out the windows to catch all the action in the courtyard."},
{"desc": "“We'll have four rappel lines set up for the superheroes to come down, say 'Hi' to the kids in their attempts to find the villain,” said Harmatuk."},
{"desc": "Wells Fargo Bank donated stuffed toys to be distributed to all the patients, and after the super heroes “defeat” villains Bane and Poison Ivy they’ll pose with children for pictures."},
{"desc": "\"Knowing that I get to make so many kid's happy all at the same time is just the best,” said Officer Grace Herbert, who will be dressed as Raven from 'Teen Titans.'"},
{"desc": "The officers practice their role and study their characters for months to make sure they’re 100 percent authentic for the patients."},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Being born without back paws hasn't stopped this playful pup. Now at Best Friends Animal Sanctuary, Justin will get all the help to give him a leg up in life. Video courtesy Jonathan Sizemore with Best Friends Animal Society.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Three-year-old Brooklyn Andracke has been waving to her neighborhood's garbage man every Thursday morning for the past year. They finally met on Brooklyn's 3rd birthday and what he did for her will melt your heart.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "This lawn care company is doing so much more than just mowing lawns and trimming hedges. They offer their services for free to those who can't care for their lawns themselves: the elderly, disabled, and single moms.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Elana Wight is helping cancer patients keep a positive outlook by spreading hope with roses.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Amelie Clarke knows there is something special waiting for her in her lunchbox every day when she goes to the lunch room.\n                                    "},
{"desc": " WTSP"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Officer White is known for his kindness, but he has outdone himself with his latest surprise for the kids who play basketball in this Florida neighborhood.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "These dogs and cats were likely going to be euthanized, until Dog Is My Copilot came to their rescue. Armed with two small planes, Peter and Judy are flying shelter animals to forever homes hundreds of miles away.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Passengers on a Southwest Airlines flight gave a dying woman a chance to say goodbye in the most beautiful way.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Fort Worth, Texas police officer Damon Cole wasn't able to save five-year-old Joshua Garcia from drowning, but he did honor the child's memory at a very special funeral service.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "A young girl's life changed forever when she was diagnosed with an enlarged heart and needed a transplant to survive. She got her new heart and, with a mere wish, she has now touched the hearts of an entire town in Haiti.\n                                    "},
{"desc": " USA TODAY"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Farmer Jonathan Lawler never expected to see hunger in his very own farming community. When he discovered how many food insecure people were living around him, Jonathan made a big change on his farm. Video shot by Mykal McEldowney from Indystar.com\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "A group of Arkansas State Troopers went above and beyond for a 10-year-old boy after no one showed up for his birthday party.\n                                    "},
{"desc": " KTHV"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "The red wagons seen scooting around Children's Healthcare of Atlanta are made by a special grandfather who invented a bracket that would allow them to carry a child's IV pole. The meaning behind the invention goes deeper than you'd think.\n                                    "},
{"desc": " VPC"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "A dining hall employee at Arizona State University was surprised by 150 students with an oversize check for nearly $2,500, printed on an image of the blues, pinks and greens of the Aurora Borealis.\n                                    "},
{"desc": " USA TODAY"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "Angelo Fracassa, 86, is retiring after working for 60 years at the IRS and riding the bus to work everyday. His family surprised him by riding the bus with him to a surprise retirement party.\n                                    "},
{"desc": " VPC"},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "After a fourth person came forward Wednesday accusing Guam Archbishop Anthony Apuron of molesting him almost 40 years ago, apostolic administrator Archbishop Savio Hon Tai Fai said that necessary steps would be taken to present the matter to the Holy"},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Members and supporters of the Concerned Catholics of Guam and Laity Forward Movement hold a protest against Archbishop Anthony Apuron at Dulce Nombre de Cathedral Basilica in Hagatna on June 19."},
{"desc": "(Photo: Frank San Nicolas, Pacific (Guam) Daily News, Hagatna, Guam)"},
{"desc": "HAGATNA, Guam — After a fourth person came forward last week "},
{"desc": "accusing Guam Archbishop Anthony Apuron of molesting him almost 40 years ago"},
{"desc": ", apostolic administrator Archbishop Savio Hon Tai Fai said necessary steps would be taken to present the matter to the Holy See."},
{"desc": "But what those steps are have not been made public. A canon lawyer also said there’s little known about how bishops accused of abusing minors are investigated."},
{"desc": "Roland Sondia"},
{"desc": ", 54, said Apuron molested him one night when he was a 15-year-old altar boy and Apuron was then a parish priest, both serving for Our Lady of Mt. Carmel Church in Agat."},
{"desc": "The Agat resident recited the alleged events of the night in 1977 at a news conference, standing before his family and the media on the steps of the pastoral center at the Dulce Nombre de Maria Cathedral-Basilica in Hagåtña. He said he told Apuron to stop when Apuron rubbed his private parts, but Apuron persisted. Sondia said he then broke away from Apuron and left the rectory in Agat in the middle of the night."},
{"desc": "In recent weeks, two other men, "},
{"desc": "Roy Quintanilla"},
{"desc": " and "},
{"desc": "Walter Denton"},
{"desc": ", have publicly and directly accused Apuron of sexually abusing them when they were altar boys. Doris Y. Concepcion, mother of a former Agat altar boy, also has accused Apuron of abusing her now deceased son."},
{"desc": "USA TODAY"},
{"desc": "3rd man accuses Guam's archbishop of rape"},
{"desc": "Minneapolis-based canon lawyer Jennifer Haselberger said while there are regulations in Canon law that dictate how to handle investigations, it refers only to how a bishop is to handle investigations of another priest."},
{"desc": "“Because the Code of Canon Law says nobody but the Holy See can investigate a bishop, they don’t need to explain that policy,” Haselberger said. “Because they’re the only ones who are going to do it.”"},
{"desc": "The pope is not going to write instructions to himself about how to investigate a bishop, Haselberger said."},
{"desc": "Haselberger also said there is no universal procedure to handle bishops accused of molesting minors."},
{"desc": "“It’s pretty vague, to put it mildly,” she said."},
{"desc": "USA TODAY"},
{"desc": "Pope OKs new rules for sacking bishops who bungle abuse cases"},
{"desc": "The three men alleging Apuron sexually abused them as kids, and their families, have publicly called for Apuron to resign."},
{"desc": "Members of Concerned Catholics of Guam and the Laity Forward Movement, who are openly critical of Apuron, also sought his resignation. While Archbishop Hon is apostolic administrator, Apuron still bears the title of archbishop of the Archdiocese of Agana."},
{"desc": "USA TODAY"},
{"desc": "Pope puts archbishop, accused of sex abuse, on leave"},
{"desc": "According to canon law, bishops who reach 75 years old are required to retire. The same law states bishops who have become “less able to fulfill his office because of ill health or some other grave cause” are to present their resignation from the office."},
{"desc": "Haselberger cited two bishops in the Minneapolis archdiocese last year, who resigned because of “some other grave cause,” before they were 75 years old."},
{"desc": "The two bishops resigned after prosecutors charged them in connection with another priest accused of sexual misconduct."},
{"desc": "Archbishop John C. Nienstedt "},
{"desc": "resigned"},
{"desc": " at the age of 68, and Auxiliary Bishop Lee Anthony Piché was 57 years old when he "},
{"desc": "resigned"},
{"desc": "."},
{"desc": "Apuron is 70 years old."},
{"desc": "Apuron, as of Wednesday, is still in Rome, according to Hon."},
{"desc": "He has denied abuse allegations made by Roy Quintanilla and the mother of Joseph “Sonny” A. Quinata."},
{"desc": "Apuron has not responded to allegations from Sondia, but hours after Sondia came forward, Archbishop Hon issued a "},
{"desc": "statement"},
{"desc": " about Sondia’s accusations. Part of the statement said that Holy See has final authority in cases related to bishops."},
{"desc": "Agat resident Sondia said the night of the alleged abuse left him in shock. “I was confused, offended, humiliated and disappointed that the man I looked up to had just asked me if I wanted to have sex with him. I cried as I walked home that night,” he said Wednesday."},
{"desc": "For victims, Haselberger said if an investigation has not yet begun, they can ask, in writing, for the congregation overseeing their diocese to investigate bishops accused of abuse."},
{"desc": "Locally, to date, Apuron has not be charged with a crime and still has the title of archbishop."},
{"desc": "According to the Office of the Attorney General, a criminal prosecution against him cannot be pursued because of existing local statute of limitations laws, and the ex post facto clause of the Constitution."},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "PEEKSKILL, N.Y. — Glenn Guzi has been hosting the British royal family at the World Trade Center site for 15 years."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Glenn Guzi, left, program director for the Port Authority of New York and New Jersey, guides Queen Elizabeth II and Prince Philip on a tour of the World Trade Center site in 2010."},
{"desc": "(Photo: Getty Images)"},
{"desc": "PEEKSKILL, N.Y. — Glenn Guzi has been "},
{"desc": "hosting the British royal family at the World Trade Center site"},
{"desc": " for 15 years."},
{"desc": "Now it's earned him an honorary title from Queen Elizabeth II."},
{"desc": "The 47-year-old program director for the Port Authority of New York and New Jersey has been named an honorary member of the Most Excellent Order of the British Empire, an exclusive membership that rewards contributions in arts, science and public service."},
{"desc": "“It was completely unexpected,\" said Guzi, a Peekskill resident whose ties to the royal family date back more than 25 years. \"I had no inclination or any indication that this was something that was going to happen or would even be possible to happen.”"},
{"desc": "It all began in 1990, when Guzi met Prince Charles and Princess Diana while studying abroad in London. Years later, Princess Anne, the queen's daughter, asked to tour the World Trade Center site of the Sept. 11, 2001 terror attacks during a visit to the U.S. Guzi, who worked for the Port Authority, was her guide."},
{"desc": "It steamrolled from there, with Guzi hosting not only the British royals, but numerous world leaders on tours of the site over the years."},
{"desc": "“It was one of these things that just started happening, where all the members of the royal family, when they’d come to New York, they’d want to see it,\" he said. \"It became this thing where it was just an evolving, ongoing relationship that over 15 years really developed into something much more than just, like, a business relationship. The queen, Her Majesty, had invited my mother and I to come visit for a garden party a number of years ago.\""},
{"desc": "The tours — and the World Trade Center site — are personal for Guzi. He worked on the 68th floor of Tower One at the time of the terror attacks. He would have been there that day but for pure chance: He took the day off to run errands."},
{"desc": "USA TODAY"},
{"desc": "Last known surviving 9/11 search dog dies at 16"},
{"desc": "“It’s very personal,\" he said. \"It’s hard to say in a brief sentence or a couple of sentences. But I think for me, what happened on that day and my involvement every day since in the rebuilding of the World Trade Center, it’s not a job. It’s been more of a sense of, ‘I have to work on fixing what happened to us at the World Trade Center.’”"},
{"desc": "Glenn Guzi after the Sept. 11, 2001 terror attacks. Guzi would have been at the World Trade Center but took the day off to run errands. Now he's become the site's liaison for British royals."},
{"desc": " "},
{"desc": "(Photo: File, The (Westchester County, N.Y.) Journal News)"},
{"desc": "Danny Lopez, British consul general to New York, said in a statement that the World Trade Center site has been \"both a place of pilgrimage and a symbol of the UK-US special relationship.\" He said Guzi's role in opening the site to dignitaries had been an important part of that process, earning him honorary membership in the Most Excellent Order of the British Empire."},
{"desc": "\"I congratulate Glenn on his well-deserved honor,\" Lopez said. \"He has provided invaluable assistance in facilitating poignant visits for many British officials and dignitaries to the World Trade Center site and its Memorial Plaza and museum. Glenn's honorary award is an acknowledgement of his significant contributions to British-American cultural relations.\""},
{"desc": "Guzi said his relationship with the royal family has been part of his own mission to see the World Trade Center site rise from the ashes."},
{"desc": "“Some of their interest when they’re in New York is to come see the World Trade Center, not because of a morbid curiosity, but because of a sense of duty and a sense, even today, that no one should really forget,\" he said."},
{"desc": "\"Even 15 years later, the message of terrorism, what it does to a people that want to live in peace, is important,\" he added. \"So, I reflect more on that rather than, ‘Oh, this is interesting and unique.’ To me, I’m always taken aback by the entire royal family’s real sense of connection and deep desire to understand and be supportive.”"},
{"desc": "Follow "},
{"desc": "Jorge Fitz-Gibbon"},
{"desc": " on Twitter: "},
{"desc": "@jfitzgibbon"},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "Some neighbors of the suburban Philadelphia man say they long suspected something wasn't right."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "\n    Authorities found 12 girls, ranging in age from six months to 18 years old, inside the home of a Pennsylvania man. Officials say 51-year-old Lee Kaplan has been charged with sexually assaulting one of the girls from 2012 to 2015.\n    "},
{"desc": "Wochit"},
{"desc": "Lee Kaplan's home on 428 Old Street Rd. in Feasterville, PA."},
{"desc": "(Photo: Aaron Windhorst, The Philadelphia Inquirer)"},
{"desc": "Some neighbors of the suburban Philadelphia man charged with sex crimes after police found him living with 12 girls say they long suspected something was wrong inside the \"creepy\" house with high weeds and boarded windows."},
{"desc": "Jen Betz told "},
{"desc": "6abc.com"},
{"desc": " that she saw the suspect, Lee Kaplan, 51, bring home a baby about six months ago. The Feasterville resident said she finally contacted authorities last week after seeing several young girls around the home, all in blue dresses and all looking scared and unhappy."},
{"desc": "\"I just wasn't gonna let go. I saw a couple girls last week standing in the driveway. They just looked unhappy and sad and again in the blue dresses,\" she told 6abc.com. \"I've been telling my husband for years something isn't right, something isn't right.\""},
{"desc": "Betz told "},
{"desc": "philly.com"},
{"desc": " that everything about Kaplan was \"creepy\" and that she called child welfare officials. They asked if she thought police should be sent to the home."},
{"desc": "\"I said 'absolutely,'\" Betz explained. \"Something needed to be done.\""},
{"desc": "USA TODAY"},
{"desc": "Man charged after 12 girls found in his house in Pennsylvania"},
{"desc": "Police, acting on Betz's tip, went into the house Thursday and found Kaplan with the girls, ages 6 months to 18 years. The 18-year-old told authorities that she and Kaplan were the parents of a 3-year-old and the 6-month-old. Kaplan faces statutory sexual assault and other charges and is being held on $1 million bail."},
{"desc": "The teen's Amish parents, who said they \"gifted\" the girl to Kaplan about four years ago after he helped them out of a financial scrap, also are being held on $1 million bail each. Police are trying to determine if all the girls who Kaplan did not father are children of the 18-year-old's parents."},
{"desc": "Erika Knoll, one of Kaplan's neighbors, told philly.com that her mother, Bonnie Knoll, had called child-protection authorities last month to report suspicions. Another neighbor, Bob Greenfield, said he wished he had called, telling the website, \"You knew something was wrong,\""},
{"desc": "Denise Horst, told "},
{"desc": "nbcphiladelphia.com"},
{"desc": " she had seen young girls timidly walking outside the house."},
{"desc": "\"The male would come out (and) they'd go running into the house,\" she said. \"I was wondering what was going on. It looked liked these girls were scared.\""},
{"desc": "Robert Hoopes, director of public safety for Lower Southampton Township, said police had previously visited the home on at least one occasion, but found insufficient cause to obtain a search warrant. Hoopes dismissed claims that numerous neighbors had called to complain about the home."},
{"desc": "\"What kind of call did they (make)?\" Hoopes asked. \"That they saw Amish people? That's the kind of calls we got. We didn't get any child abuse calls. If it was a child abuse call we would have responded.\""},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "SALEM, Ore. — Stray, free-roaming and even pet cats found in the 97301 area are eligible for free spay or neuter surgery, as well as vaccines and flea treatment thanks to a grant."},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Kirsten Straus, the community cat coordinator with the Willamette Humane Society, holds a trap used to catch cats so they can be fixed, part of a free spay and neuter program for cats in the 97301 zip code."},
{"desc": "(Photo: Anna Reed, (Salem, Ore.) Statesman Journal)"},
{"desc": "SALEM, Ore. — Stray, free-roaming and even pet cats found in the 97301 area are eligible for "},
{"desc": "free spay or neuter surgery, as well as vaccines and flea treatment "},
{"desc": "thanks to a grant."},
{"desc": "The $116,190 grant through Petsmart Charities will help cats on the largest scale the Salem, Ore., community has ever seen, Willamette Humane Society officials said."},
{"desc": "Residents in the 97301 will be able to trap, neuter, and return stray cats at no cost through the Willamette Humane Society and "},
{"desc": "The Marion Polk Community Cat Program"},
{"desc": ". Locals might also receive onsite assistance from volunteer trappers to assist in identifying, trapping, transporting and documenting the local cat population. Owned indoor cats could also qualify for free surgery through this program, with some age restrictions. People who are aware of or feeding stray cats in the area are encouraged to contact "},
{"desc": "ccc@whs4pets.org"},
{"desc": " or call 503-585-5900 Ext. 313."},
{"desc": "Willamette Humane Society board member Shannon Priem was among the volunteers who went door-to-door in a downpour Saturday, spreading the word about the free services."},
{"desc": "\"We picked the 97301 zip code because census and demographic studies show these neighborhoods have the most free-roaming cats,\" Priem said. \"They also tend to be poorer neighborhoods, so they need our help.\""},
{"desc": "Settings"},
{"desc": "Cancel"},
{"desc": "Set"},
{"desc": "Hi "},
{"desc": "Already a subscriber?"},
{"desc": "Subscribe today to additional USAToday products."},
{"desc": "Already a print edition subscriber, but don't have a login?"},
{"desc": "Manage your account settings."},
{"desc": "Log Out"},
{"desc": "Get the news"},
{"desc": "Share"},
{"desc": "Let friends in your social network know what you are reading about"},
{"desc": "INDIANAPOLIS, Ind. — More than 150 officers swept across several neighborhoods on Saturday as part of the largest tactical operation in Indianapolis Metropolitan Police Department’s history. ​"},
{"desc": "A link has been sent to your friend's email address."},
{"desc": "A link has been posted to your Facebook feed. "},
{"desc": "To find out more about Facebook commenting please read the "},
{"desc": "Conversation Guidelines and FAQs"},
{"desc": "Embed"},
{"desc": "Share"},
{"desc": "\n    More than 150 officers swept across several neighborhoods on Saturday as part of the largest tactical operation in Indianapolis Metropolitan Police Department’s history.\n    "},
{"desc": "Michael Anthony Adams / IndyStar"},
{"desc": "A man is placed into custody by Marion County Sheriff's Deputy Jose Sanchez, in the 1600 block of North Irvington, Indianapolis, Saturday, June 18, 2016. IMPD led an interagency effort to serve warrants on a variety of violent and drug-related charges. At least 25 people were arrested and four handguns were recovered in Operation First Step."},
{"desc": "(Photo: Robert Sheer, The Indianapolis Star)"},
{"desc": "INDIANAPOLIS, Ind. — More than 150 officers swept across several neighborhoods on Saturday as part of the "},
{"desc": "largest tactical operation in Indianapolis Metropolitan Police Department’s history"},
{"desc": ". ​"},
{"desc": "Named "},
{"desc": "Operation First Step"},
{"desc": ", the sweep's goal was to remove some of the most violent offenders, and those with propensities for violence, from Indianapolis' streets. Officers flooded areas frequented by drug dealers, and searched for people with open warrants or parole violations, IMPD Chief Troy Riggs​ told "},
{"desc": "IndyStar"},
{"desc": "."},
{"desc": "Officers also detained people who police believe may have vital information that can help detectives "},
{"desc": "solve open cases"},
{"desc": "."},
{"desc": "“This is not a blanket sweep,” Riggs said. “This is about making quality arrests.\""},
{"desc": "By Saturday's end, police had arrested 26 people. Officers also seized four handguns, 13 grams of heroin, 8.5 grams of cocaine and marijuana, $3,500 in cash and three cars. They also disrupted a marijuana growing operation in the basement of an east-side home and brought down a bootlegger, seizing 92 bottles of gin, 23 bottles of vodka and 182 cans of beer."},
{"desc": "Standing in the Regional Operations Center on the city's east side, Riggs updated an "},
{"desc": "IndyStar"},
{"desc": " reporter on the night's progress."},
{"desc": "\"On the street, they're already hearing we're out,\" Riggs said."},
{"desc": "As officers moved in on target houses, word quickly made its way back to the ROC, as the center is called. The number of arrests, penned in blue ink on a whiteboard, is erased and re-tabulated."},
{"desc": "And in the Department of Homeland Security Situation Room, investigators scoured the social media accounts of those arrested, looking for photos and videos that may help strengthen the cases against them."},
{"desc": "Each warrant team, Riggs said, consisted of 15 to 20 officers. The "},
{"desc": "FBI"},
{"desc": ", "},
{"desc": "Bureau of Alcohol, Tobacco, Firearms and Explosives"},
{"desc": ", "},
{"desc": "Drug Enforcement Administration"},
{"desc": ", and other city agencies assisted IMPD during the operation. Faith leaders, too, helped to comfort those who were around to see their loved ones taken away in handcuffs."},
{"desc": "The arrested suspects were brought back to the ROC for questioning, then moved to the Marion County Jail for processing."},
{"desc": "Near dusk, IMPD narcotics officers raided a home in the 1600 block of N. Irvington Avenue. A young woman, tears welling up in her eyes, held a small child on her lap as officers entered the house."},
{"desc": "Eventually a man was brought out in cuffs and placed in the jail transport van. He's facing charges of possession and dealing drugs."},
{"desc": "Claude Commodore, who lives near the home, told "},
{"desc": "IndyStar"},
{"desc": " that he's glad to see police doing this kind of work \"the right way.\""},
{"desc": "\"It's just good no one's hurt,\" Commodore said. \"Things are going the way they should be done: straightening up and cleaning up the neighborhoods.\""},
{"desc": "All told, 162 IMPD officers, federal agents and clergy members participated in the sweep. They targeted areas inside IMPD's North, East and Northwest districts."},
{"desc": "In January, when Riggs and Mayor Joe Hogsett "},
{"desc": "laid out their plans to curb violence and crime in the city"},
{"desc": ", the duo spoke about a list of 1,400 people with outstanding warrants related to assault or weapons violations, including 91 people with warrants out in both. It wasn't immediately clear if Saturday's operation was connected to that list."},
{"desc": "The operation comes as IMPD homicide detectives continue to "},
{"desc": "make several arrests in recent slayings"},
{"desc": ", re-enforcing Hogsett’s pledge to overhaul public safety after the city witnessed 144 criminal homicides last year, "},
{"desc": "making it the city's deadliest year"},
{"desc": "."},
{"desc": "Hogsett's and Riggs' plans also called for a stronger commitment to community policing, including an expansion of so-called "},
{"desc": "beat cops with more focused patrol areas"},
{"desc": ". The goal, they've said, is to improve the relationship between police and members of the community, as well as forge partnerships to help fight crime."},
{"desc": "On Monday, officers will return to the neighborhoods where warrants were served, Riggs said. The operation has concluded, but neighborhoods will see increased police activity as officers follow up on leads gathered Saturday night."},
{"desc": "Officers also will talk to residents in those neighborhoods, asking for feedback on the operation."},
{"desc": "Follow Michael Anthony Adams on Twitter: "},
{"desc": "@michaeladams317"},
{"desc": "."},
{"desc": " IndyStar reporters Madeline Buckley and Jill Disis contributed to this story. "}
]